node {
  name: "input_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 576
        }
        dim {
          size: 800
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "conv1_pad/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "conv1_pad/Pad"
  op: "Pad"
  input: "input_1"
  input: "conv1_pad/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "conv1/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1380131095647812
      }
    }
  }
}
node {
  name: "conv1/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1380131095647812
      }
    }
  }
}
node {
  name: "conv1/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "conv1/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7127353
    }
  }
}
node {
  name: "conv1/random_uniform/sub"
  op: "Sub"
  input: "conv1/random_uniform/max"
  input: "conv1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1/random_uniform/mul"
  op: "Mul"
  input: "conv1/random_uniform/RandomUniform"
  input: "conv1/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1/random_uniform"
  op: "Add"
  input: "conv1/random_uniform/mul"
  input: "conv1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1/kernel/Assign"
  op: "Assign"
  input: "conv1/kernel"
  input: "conv1/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1/kernel/read"
  op: "Identity"
  input: "conv1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
}
node {
  name: "conv1/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "conv1/convolution"
  op: "Conv2D"
  input: "conv1_pad/Pad"
  input: "conv1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/gamma"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/gamma/Assign"
  op: "Assign"
  input: "conv1_bn/gamma"
  input: "conv1_bn/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/gamma/read"
  op: "Identity"
  input: "conv1_bn/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/gamma"
      }
    }
  }
}
node {
  name: "conv1_bn/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/beta"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/beta/Assign"
  op: "Assign"
  input: "conv1_bn/beta"
  input: "conv1_bn/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/beta/read"
  op: "Identity"
  input: "conv1_bn/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/beta"
      }
    }
  }
}
node {
  name: "conv1_bn/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_mean"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_mean/Assign"
  op: "Assign"
  input: "conv1_bn/moving_mean"
  input: "conv1_bn/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_mean/read"
  op: "Identity"
  input: "conv1_bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_variance"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_variance/Assign"
  op: "Assign"
  input: "conv1_bn/moving_variance"
  input: "conv1_bn/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_variance/read"
  op: "Identity"
  input: "conv1_bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "conv1/kernel"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/IsVariableInitialized_1"
  op: "IsVariableInitialized"
  input: "conv1_bn/gamma"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/IsVariableInitialized_2"
  op: "IsVariableInitialized"
  input: "conv1_bn/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/IsVariableInitialized_3"
  op: "IsVariableInitialized"
  input: "conv1_bn/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/IsVariableInitialized_4"
  op: "IsVariableInitialized"
  input: "conv1_bn/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/init"
  op: "NoOp"
  input: "^conv1/kernel/Assign"
  input: "^conv1_bn/beta/Assign"
  input: "^conv1_bn/gamma/Assign"
  input: "^conv1_bn/moving_mean/Assign"
  input: "^conv1_bn/moving_variance/Assign"
}
node {
  name: "conv1_bn/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "conv1_bn/Const_5"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "conv1_bn/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "conv1/convolution"
  input: "conv1_bn/gamma/read"
  input: "conv1_bn/beta/read"
  input: "conv1_bn/Const_4"
  input: "conv1_bn/Const_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/Shape"
  op: "Shape"
  input: "conv1/convolution"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1_bn/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice"
  op: "StridedSlice"
  input: "conv1_bn/Shape"
  input: "conv1_bn/strided_slice/stack"
  input: "conv1_bn/strided_slice/stack_1"
  input: "conv1_bn/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "conv1_bn/Shape_1"
  op: "Shape"
  input: "conv1/convolution"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1_bn/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_1"
  op: "StridedSlice"
  input: "conv1_bn/Shape_1"
  input: "conv1_bn/strided_slice_1/stack"
  input: "conv1_bn/strided_slice_1/stack_1"
  input: "conv1_bn/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "conv1_bn/Shape_2"
  op: "Shape"
  input: "conv1/convolution"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1_bn/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/strided_slice_2"
  op: "StridedSlice"
  input: "conv1_bn/Shape_2"
  input: "conv1_bn/strided_slice_2/stack"
  input: "conv1_bn/strided_slice_2/stack_1"
  input: "conv1_bn/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "conv1_bn/Rank/packed"
  op: "Pack"
  input: "conv1_bn/strided_slice"
  input: "conv1_bn/strided_slice_1"
  input: "conv1_bn/strided_slice_2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "conv1_bn/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "conv1_bn/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv1_bn/range"
  op: "Range"
  input: "conv1_bn/range/start"
  input: "conv1_bn/Rank"
  input: "conv1_bn/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1_bn/Prod/input"
  op: "Pack"
  input: "conv1_bn/strided_slice"
  input: "conv1_bn/strided_slice_1"
  input: "conv1_bn/strided_slice_2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "conv1_bn/Prod"
  op: "Prod"
  input: "conv1_bn/Prod/input"
  input: "conv1_bn/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/Cast"
  op: "Cast"
  input: "conv1_bn/Prod"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv1_bn/sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0010000467300415
      }
    }
  }
}
node {
  name: "conv1_bn/sub"
  op: "Sub"
  input: "conv1_bn/Cast"
  input: "conv1_bn/sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/truediv"
  op: "RealDiv"
  input: "conv1_bn/Cast"
  input: "conv1_bn/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/mul"
  op: "Mul"
  input: "conv1_bn/FusedBatchNorm:2"
  input: "conv1_bn/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_mean/biased"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_mean/biased/Assign"
  op: "Assign"
  input: "conv1_bn/moving_mean/biased"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_mean/biased/read"
  op: "Identity"
  input: "conv1_bn/moving_mean/biased"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/moving_mean/local_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_mean/local_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_mean/local_step/Assign"
  op: "Assign"
  input: "conv1_bn/moving_mean/local_step"
  input: "conv1_bn/moving_mean/local_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_mean/local_step/read"
  op: "Identity"
  input: "conv1_bn/moving_mean/local_step"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub"
  op: "Sub"
  input: "conv1_bn/moving_mean/biased/read"
  input: "conv1_bn/FusedBatchNorm:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/mul"
  op: "Mul"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub"
  input: "conv1_bn/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/conv1_bn/moving_mean"
  op: "AssignSub"
  input: "conv1_bn/moving_mean/biased"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd/value"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd"
  op: "AssignAdd"
  input: "conv1_bn/moving_mean/local_step"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd/value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/read"
  op: "Identity"
  input: "conv1_bn/moving_mean/biased"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/conv1_bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_1/x"
  op: "Const"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/conv1_bn/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_1"
  op: "Sub"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_1/x"
  input: "conv1_bn/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/read_1"
  op: "Identity"
  input: "conv1_bn/moving_mean/local_step"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/conv1_bn/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/Pow"
  op: "Pow"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_1"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/read_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_2/x"
  op: "Const"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/conv1_bn/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_2"
  op: "Sub"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_2/x"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/Pow"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/truediv"
  op: "RealDiv"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/read"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_3"
  op: "Sub"
  input: "conv1_bn/moving_mean/read"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg"
  op: "AssignSub"
  input: "conv1_bn/moving_mean"
  input: "conv1_bn/AssignMovingAvg/conv1_bn/moving_mean/sub_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_variance/biased"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_variance/biased/Assign"
  op: "Assign"
  input: "conv1_bn/moving_variance/biased"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_variance/biased/read"
  op: "Identity"
  input: "conv1_bn/moving_variance/biased"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/moving_variance/local_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1_bn/moving_variance/local_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1_bn/moving_variance/local_step/Assign"
  op: "Assign"
  input: "conv1_bn/moving_variance/local_step"
  input: "conv1_bn/moving_variance/local_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1_bn/moving_variance/local_step/read"
  op: "Identity"
  input: "conv1_bn/moving_variance/local_step"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub"
  op: "Sub"
  input: "conv1_bn/moving_variance/biased/read"
  input: "conv1_bn/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/mul"
  op: "Mul"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub"
  input: "conv1_bn/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/conv1_bn/moving_variance"
  op: "AssignSub"
  input: "conv1_bn/moving_variance/biased"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd/value"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd"
  op: "AssignAdd"
  input: "conv1_bn/moving_variance/local_step"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd/value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/read"
  op: "Identity"
  input: "conv1_bn/moving_variance/biased"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/conv1_bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_1/x"
  op: "Const"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/conv1_bn/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_1"
  op: "Sub"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_1/x"
  input: "conv1_bn/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/read_1"
  op: "Identity"
  input: "conv1_bn/moving_variance/local_step"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/conv1_bn/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/Pow"
  op: "Pow"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_1"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/read_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_2/x"
  op: "Const"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/AssignAdd"
  input: "^conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/conv1_bn/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_2"
  op: "Sub"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_2/x"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/Pow"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/truediv"
  op: "RealDiv"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/read"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_3"
  op: "Sub"
  input: "conv1_bn/moving_variance/read"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/AssignMovingAvg_1"
  op: "AssignSub"
  input: "conv1_bn/moving_variance"
  input: "conv1_bn/AssignMovingAvg_1/conv1_bn/moving_variance/sub_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv1_bn/keras_learning_phase/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "conv1_bn/keras_learning_phase"
  op: "PlaceholderWithDefault"
  input: "conv1_bn/keras_learning_phase/input"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "conv1_bn/cond/Switch"
  op: "Switch"
  input: "conv1_bn/keras_learning_phase"
  input: "conv1_bn/keras_learning_phase"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv1_bn/cond/switch_t"
  op: "Identity"
  input: "conv1_bn/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv1_bn/cond/switch_f"
  op: "Identity"
  input: "conv1_bn/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv1_bn/cond/pred_id"
  op: "Identity"
  input: "conv1_bn/keras_learning_phase"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv1_bn/cond/Switch_1"
  op: "Switch"
  input: "conv1_bn/FusedBatchNorm"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/FusedBatchNorm"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/add/y"
  op: "Const"
  input: "^conv1_bn/cond/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/add"
  op: "Add"
  input: "conv1_bn/cond/batchnorm/add/Switch"
  input: "conv1_bn/cond/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/add/Switch"
  op: "Switch"
  input: "conv1_bn/moving_variance/read"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "conv1_bn/cond/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul"
  op: "Mul"
  input: "conv1_bn/cond/batchnorm/Rsqrt"
  input: "conv1_bn/cond/batchnorm/mul/Switch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul/Switch"
  op: "Switch"
  input: "conv1_bn/gamma/read"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/gamma"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul_1"
  op: "Mul"
  input: "conv1_bn/cond/batchnorm/mul_1/Switch"
  input: "conv1_bn/cond/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul_1/Switch"
  op: "Switch"
  input: "conv1/convolution"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/convolution"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul_2"
  op: "Mul"
  input: "conv1_bn/cond/batchnorm/mul_2/Switch"
  input: "conv1_bn/cond/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/mul_2/Switch"
  op: "Switch"
  input: "conv1_bn/moving_mean/read"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/sub"
  op: "Sub"
  input: "conv1_bn/cond/batchnorm/sub/Switch"
  input: "conv1_bn/cond/batchnorm/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/sub/Switch"
  op: "Switch"
  input: "conv1_bn/beta/read"
  input: "conv1_bn/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1_bn/beta"
      }
    }
  }
}
node {
  name: "conv1_bn/cond/batchnorm/add_1"
  op: "Add"
  input: "conv1_bn/cond/batchnorm/mul_1"
  input: "conv1_bn/cond/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_bn/cond/Merge"
  op: "Merge"
  input: "conv1_bn/cond/batchnorm/add_1"
  input: "conv1_bn/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_relu/Relu"
  op: "Relu"
  input: "conv1_bn/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv1_relu/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 6.0
      }
    }
  }
}
node {
  name: "conv1_relu/Minimum"
  op: "Minimum"
  input: "conv1_relu/Relu"
  input: "conv1_relu/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_pad_1/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "conv_pad_1/Pad"
  op: "Pad"
  input: "conv1_relu/Minimum"
  input: "conv_pad_1/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_dw_1/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "conv_dw_1/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.14213381707668304
      }
    }
  }
}
node {
  name: "conv_dw_1/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14213381707668304
